/*************************************************************************
*
*   Copyright (C), 2025-2045, bpg. Co., Ltd.
*
*   文件名称: cdevice.cpp
*   软件模块: 应用
*   版 本 号: 1.0
*   生成日期: 2025-11-04
*   作    者: lium
*   功    能: 实例类对象头文件
*
**********************************************************************/

#ifndef CDEVICE_H
#define CDEVICE_H

#include "cMFCFrame.h"

class CDevice : public LObject {
DECLARE_DYNAMIC(CDevice)
public:
    CDevice();
    void deviceRun();
};

#endif // CDEVICE_H

/*************************************************************************
* 改动历史纪录：
Revision 1.0, 2025-11-04, lium
describe: 初始创建.
*************************************************************************/